diplom-src/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_НачалоДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_КонецДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

diplom-src/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

diplom-src/src/Catalogs/ДоговорыКонтрагентов/Forms/ВКМ_ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВКМ_ДобавитьПоляВвода();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВКМ_ВидДоговораПриИзменении(Элемент)
	
	ЗначениеАбонентскаяПлата = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание");
	
	Если Объект.ВидДоговора = ЗначениеАбонентскаяПлата Тогда
		Элементы["ВКМ_ГруппаАбонентскаяПлата"].Видимость = Истина;
	Иначе 
		Элементы["ВКМ_ГруппаАбонентскаяПлата"].Видимость = Ложь;			
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВКМ_ДобавитьПоляВвода()

	ГруппаАбонентскаяПлата = Элементы.Добавить("ВКМ_ГруппаАбонентскаяПлата", Тип("ГруппаФормы"));
	ГруппаАбонентскаяПлата.Заголовок = "Реквизиты абонентской платы";
	ГруппаАбонентскаяПлата.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаАбонентскаяПлата.ОтображатьЗаголовок = Истина; 
	ГруппаАбонентскаяПлата.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаАбонентскаяПлата.РастягиватьПоГоризонтали = ИСТИНА;
	ГруппаАбонентскаяПлата.Видимость = Ложь;
	
	ГруппаПериодДействияДоговора = Элементы.Добавить("ВКМ_ГруппаПериодДействияДоговора", Тип("ГруппаФормы"), ГруппаАбонентскаяПлата);	
	ГруппаПериодДействияДоговора.Заголовок = "Период действия договора";
	ГруппаПериодДействияДоговора.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПериодДействияДоговора.ОтображатьЗаголовок = Ложь; 
	ГруппаПериодДействияДоговора.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаПериодДействияДоговора.РастягиватьПоГоризонтали = ИСТИНА;
	
	НачалоДействияДоговора = Элементы.Добавить("ВКМ_НачалоДействияДоговора", Тип("ПолеФормы"), ГруппаПериодДействияДоговора);
	НачалоДействияДоговора.Заголовок = "Начало действия договора";
	НачалоДействияДоговора.Вид = ВидПоляФормы.ПолеВвода;
	НачалоДействияДоговора.ПутьКДанным = "Объект.ВКМ_НачалоДействияДоговора";
	
	КонецДействияДоговора = Элементы.Добавить("ВКМ_КонецДействияДоговора", Тип("ПолеФормы"), ГруппаПериодДействияДоговора);
	КонецДействияДоговора.Заголовок = "Конец действия договора";
	КонецДействияДоговора.Вид = ВидПоляФормы.ПолеВвода;
	КонецДействияДоговора.ПутьКДанным = "Объект.ВКМ_КонецДействияДоговора";
	
	СуммаАбонентскойПлаты = Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты", Тип("ПолеФормы"), ГруппаАбонентскаяПлата);
	СуммаАбонентскойПлаты.Заголовок = "Сумма абонентской платы";
	СуммаАбонентскойПлаты.Вид = ВидПоляФормы.ПолеВвода;
	СуммаАбонентскойПлаты.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	
	СтоимостьЧасаРаботы = Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"), ГруппаАбонентскаяПлата);
	СтоимостьЧасаРаботы.Заголовок = "Стоимость часа работы";
	СтоимостьЧасаРаботы.Вид = ВидПоляФормы.ПолеВвода;
	СтоимостьЧасаРаботы.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	
КонецПроцедуры	

#КонецОбласти
